*_________ uses system of color coding to represent different values.
Heat Map

*When the content is very less, we can leverage _________ to display information.
Simple Text

*_______ helps you get familiar with data.
Exploratory analysis









**Which among the following are the preattentive attributes?
Both Color and Size

**'If I had more time, I would have written a shorter letter'. This statement is written by whom?
Blaise Pascal

**The concept of accessibility helps people of different abilities to use designs.
True

**Which principle from the list is not Principles of Gestalt Perception?
Differential

**Which graph displays data in top-to-bottom fashion?
Horizontal Bar

**Clutter helps in increasing the communication with Audiences?
False

**It is a good practice to use 3D to plot a single dimensional data.
True

**If the data in your content is very less then _________ is best to use.
Simple Text

**What are the visual elements that take up space but do not increase understanding?
Clutter

**Which category of Graphs need to be avoided?
All the options

**__________ is not a step in the process of decluttering.
Remove color

**Using Tables during Live presentations is a good option.
False



**Which are the different categories of Graphs?
All the options

**__________ is the most widely and commonly used graph.
Bar Graph

**You can paste the data wherever you wish during a presentation.
False

**Including Zero baseline is a good practice.
True

**Clutter helps build a comfortable user experience for your audience.
False

*________ helps you establish a structure for your communication.
Storyboarding

*Color can be neglected if your content is clear.
True

*Keeping Color consistent helps the audiences to know that these two pieces of information are related.
True

*Good data visualization is a collection of graphs on a topic.
True

*Tone of the language can be compromised.
False

*Turning on the rulers or gridlines that are built into most of the software programs helps in alignin
True

*Which graphs are used to plot continuous data?
Line Graphs

*Cognitive load theory is created by __________.
John Sweller

*With this principle, we tend to think of objects that are physically close together as belonging to part of a group. Which principle is explained here?
Proximity

*I am checking few sites to understand the retail market for a brand.' This statement depicts which analysis?
Exploratory

*Decluttering should be done only when we have Ticket processing?
False

*Which graph has very minimal use cases?
Stacked Vertical bar

*When using the Bar graph, the width of the Bars must be ___________.
Right size

*What helps you show differences across various categories between the two data points?
Slopegraph

*If Lines are overlapping then SlopeGraph is the best to use.
True

*What ensures to the point communication?
Storyboarding

*What is not a part of story telling with data?
Out of Box thinking

**Which graph is useful when you have two time periods or points of comparison and want to quickly show relative increases and decreases?
Slope Graph

*


